
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	Для каждого Стр Из ЖурналНачислений Цикл
		Запись = Движения.ЖурналНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Стр);
		Запись.ПериодРегистрации = Дата;
		Запись.ПериодДействияКонец = КонецДня(Запись.ПериодДействияКонец); 
	КонецЦикла; 
	
	Для каждого Стр Из ДопНачисления Цикл
		Запись = Движения.ДопНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Стр);
		Запись.ПериодРегистрации = Дата;
	КонецЦикла; 
	
	ЗаписиСторно = Движения.ЖурналНачислений.ПолучитьДополнение();
	Для каждого Стр Из ЗаписиСторно Цикл
		Запись = Движения.ЖурналНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Стр);
		Запись.ПериодРегистрации = Стр.ПериодРегистрацииСторно;
		Запись.ПериодДействияНачало = Стр.ПериодДействияНачалоСторно; 
		Запись.ПериодДействияКонец = КонецДня(Стр.ПериодДействияКонецСторно); 
		Запись.Сторно = Истина;
	КонецЦикла; 
	
	//Движения.ЖурналНачислений.Записывать = Истина;
	
	Движения.ЖурналНачислений.Записать(,,,ЛОЖЬ);
	Движения.ДопНачисления.Записать(,,,ЛОЖЬ);

	Расчет.РассчитатьЗаписи(Ссылка, НачалоМесяца(Дата) );
	
КонецПроцедуры
