
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОбновитьФИО();
	
	Если ПустаяСтрока(Объект.Отчество) Тогда
		Возврат;
		//Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолСотрудника.ПустаяСсылка");
		//Объект.Пол = "";
	КонецЕсли; 
	
	ОкончаниеОтчества = НРег(Прав(Объект.Отчество, 2));
	Если ОкончаниеОтчества = "на" Тогда
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолСотрудника.Женский");
	ИначеЕсли ОкончаниеОтчества = "ич" Тогда
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолСотрудника.Мужской");
	Иначе
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолСотрудника.ПустаяСсылка");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФИО()
	Объект.Наименование = Объект.Фамилия + " " + Лев(Объект.Имя,1) + "." + Лев(Объект.Отчество, 1) + ".";
КонецПроцедуры
  