
&НаСервере
Процедура СформироватьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналНачисленийФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
	|	ЖурналНачисленийФактическийПериодДействия.Сотрудник КАК Сотрудник,
	|	ЖурналНачисленийФактическийПериодДействия.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ЖурналНачисленийФактическийПериодДействия.ПериодДействияКонец КАК ПериодДействияКонец
	|ИЗ
	|	РегистрРасчета.ЖурналНачислений.ФактическийПериодДействия КАК ЖурналНачисленийФактическийПериодДействия";
	//Запрос.УстановитьПараметр("", );
	РезультатЗапроса = Запрос.Выполнить();
	
	Диаграмма.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Точка = Диаграмма.УстановитьТочку(Выборка.Сотрудник);
		Серия = Диаграмма.УстановитьСерию(Выборка.ВидРасчета);
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Выборка.ПериодДействияНачало;
		Интервал.Конец = Выборка.ПериодДействияКонец;
		
	КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
