

//Процедура ПриНачалеРаботыСистемы()
//	
//	Сообщить("Добро пожаловать, сегодня " + ТекущаяДата());
//	НазваниеЗаполнено = ВызовСервера.КонстантаЗаполнена();
//	
//	Если НЕ НазваниеЗаполнено Тогда
//		Сообщить("Введите сведения об организации!");
//	КонецЕсли; 
//	
//	
//	
//	ДР = '19801112';
//	Сегодня = НачалоДня(ТекущаяДата());
//	
//	СекундПрошло = Сегодня - ДР;
//	Сообщить("Со дня рождения прошло: " + СекундПрошло);
//	
//	СледующийДР = '20181112';
//	ДнейДО = Цел((СледующийДР - Сегодня) / 86400);
//	Сообщить("До следующего ДР осталось " + ДнейДО + " дней");
//КонецПроцедуры


//Процедура Рассчитать(Парам1, Парам2)
//	А = Парам1 + Парам2;	
//КонецПроцедуры
// 
//Функция Разница(Парам1, Парам2)
//	А = парам1 - Парам2;	
//	Возврат А;
//КонецФункции
// 

//Рассчитать(10,20);

//П = Разница(20, 10);