
&НаСервере
Процедура ЗаполнитьНаСервере()
	ТекДата = Период.ДатаНачала;
	НачатьТранзакцию();
	
	КолСтрок = ШаблонЗаполнения.Количество();
	
	Пока ТекДата <= Период.ДатаОкончания Цикл
		
		Индекс = (ТекДата - Период.ДатаНачала) / 86400 % КолСтрок;
		
		Запись = РегистрыСведений.Календарь.СоздатьМенеджерЗаписи();
		Запись.Дата = ТекДата;
		Запись.Признак = ШаблонЗаполнения [Индекс].Признак ;
		Запись.Подразделение = Подразделение;
		Запись.КолЧасов = ШаблонЗаполнения [Индекс].КолЧасов;
		Запись.График = График;
		Запись.Записать();
		
		//Запись.Удалить();
		ТекДата = ТекДата + 86400;
		
	КонецЦикла; 
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Сообщить(ОписаниеОшибки());
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	ПоказатьОповещениеПользователя("Все ок");
КонецПроцедуры
