
Процедура ОбработкаПроведения(Отказ, Режим)
	Если ВидПоступления = 0 Тогда
		СчетУчетаТоваров = ПланыСчетов.ПланСчетов.Товары;
	Иначе
		СчетУчетаТоваров = ПланыСчетов.ПланСчетов.ТоварыОпт;
	КонецЕсли; 
	
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.СтоимостьТоваров.Записывать = Истина;
	Движения.РегистрБухгалтерии.Записывать = Истина;
	
	ТЗ = Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура","Количество, Сумма, УпрСумма");
	
	Для Каждого ТекСтрокаТовары Из ТЗ Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		Движение = Движения.СтоимостьТоваров.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Партия = Ссылка;
		Движение.Количество = 	ТекСтрокаТовары.Количество;
		Движение.Стоимость =  	ТекСтрокаТовары.Сумма;
		
		Проводка = Движения.РегистрБухгалтерии.Добавить();
		Проводка.Период = Дата;
		Проводка.СчетДт = СчетУчетаТоваров;
		Проводка.СчетКт = ПланыСчетов.ПланСчетов.Поставщики;
		Проводка.СубконтоДт.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Проводка.СубконтоДт.Склады = Склад;
		Проводка.Сумма = ТекСтрокаТовары.Сумма;
		Проводка.УпрСумма = ТекСтрокаТовары.УпрСумма;
		Проводка.КоличествоДт = ТекСтрокаТовары.Количество;
		Проводка.СодержаниеПроводки = "Поступили товары";
		
		//Проводка.КоличествоКт = ТекСтрокаТовары.Количество; //Ошибка
		
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		
	КонецЦикла;
КонецПроцедуры
