
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для каждого Проводка Из Движения.РегистрБухгалтерии Цикл
		Проводка.Период = Дата;
		Проводка.ЮрЛицо = ЮрЛицо;
	КонецЦикла; 
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	НаборЗаписей = РегистрыБухгалтерии.РегистрБухгалтерии.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать(); 
	НаборЗаписей.УстановитьАктивность(НЕ ПометкаУдаления);
	НаборЗаписей.Записать();
КонецПроцедуры
